In [130]:
import numpy as np
import pandas as pd

In [131]:
dic = {'column':['aab','aab','aab','bca','bca','cbb','cbb','ccc','aab']}

In [132]:
df=pd.DataFrame(dic)

In [133]:
df

  column
0    aab
1    aab
2    aab
3    bca
4    bca
5    cbb
6    cbb
7    ccc
8    aab

In [134]:
df.shift()

  column
0    NaN
1    aab
2    aab
3    aab
4    bca
5    bca
6    cbb
7    cbb
8    ccc

In [135]:
df.duplicated()

0    False
1     True
2     True
3    False
4     True
5    False
6     True
7    False
8     True
dtype: bool

In [136]:
df.column[0]

'aab'

In [137]:
for i in range(len(df)):
    print(df.column[i])

aab
aab
aab
bca
bca
cbb
cbb
ccc
aab

In [138]:
for i in range(len(df)-1):
    print(df.column[i],df.column[i+1])

aab aab
aab aab
aab bca
bca bca
bca cbb
cbb cbb
cbb ccc
ccc aab

In [139]:
#for i in range(len(df)-1):
    #if df.column[i] == df.column[i+1]:
        #df['rep'][i] = 2
    #else:
        #df['rep'][i] = 1

In [140]:
df

  column
0    aab
1    aab
2    aab
3    bca
4    bca
5    cbb
6    cbb
7    ccc
8    aab

In [141]:
df.shift(3)

  column
0    NaN
1    NaN
2    NaN
3    aab
4    aab
5    aab
6    bca
7    bca
8    cbb

In [142]:
df.column[1] == df.shift().column[1]

True

In [143]:
for i in range(len(df)):
    print(df.column[i] == df.shift().column[i])

False
True
True
False
True
False
True
False
False

In [144]:
# Labeling each subgroup column value by comparing each row with consecutive one
df['subgroup'] = (df['column'] != df['column'].shift(1)).cumsum()

In [145]:
df

  column  subgroup
0    aab         1
1    aab         1
2    aab         1
3    bca         2
4    bca         2
5    cbb         3
6    cbb         3
7    ccc         4
8    aab         5

In [155]:
size

   unique_values  Group Size
0              2           2
1              1           2
2              3           1

In [127]:
df.groupby('subgroup').count()

          column
subgroup
1              3
2              2
3              2
4              1
5              1

In [148]:
size = pd.DataFrame(df.groupby('subgroup').count().reset_index())

In [149]:
size

   subgroup  column
0         1       3
1         2       2
2         3       2
3         4       1
4         5       1

In [153]:
size[size['subgroup']==3]['column']

2    2
Name: column, dtype: int64

In [154]:
size = size['column'].value_counts().rename_axis('unique_values').reset_index(name='Group Size')

In [128]:
#df = df['column'].value_counts().rename_axis('unique_values').reset_index(name='Group Size')

In [129]:
df

  unique_values  Group Size
0           aab           4
1           bca           2
2           cbb           2
3           ccc           1

In [103]:
df

  column  subgroup  size
0    aab         1   NaN
1    aab         1   3.0
2    aab         1   2.0
3    bca         2   2.0
4    bca         2   1.0
5    cbb         3   1.0
6    cbb         3   NaN
7    ccc         4   NaN
8    aab         5   NaN

In [54]:
df.apply(lambda x: x.count())

column      8
subgroup    8
dtype: int64

In [59]:
df['rep']= df.groupby('subgroup').count()

In [68]:
(df['column'] != df['column'].shift(1)).cumsum()

0    1
1    1
2    1
3    2
4    2
5    3
6    3
7    4
Name: column, dtype: int32

In [60]:
df

  column  subgroup  rep
0    aab         1  NaN
1    aab         1  3.0
2    aab         1  2.0
3    bca         2  2.0
4    bca         2  1.0
5    cbb         3  NaN
6    cbb         3  NaN
7    ccc         4  NaN

In [72]:
df.groupby('subgroup',as_index=False).apply(lambda x: (x['column'].head(1),x.shape[0]))

0    ([aab], 3)
1    ([bca], 2)
2    ([cbb], 2)
3    ([ccc], 1)
dtype: object

In [ ]:
df['size'] = df.apply()